"""1. Написать функцию, которая для заданного натурального числа вычисляет
сумму его цифр. """

def sum_digits(n):
    digits = str(n)
    digit_list = []
    for digit in digits:
        digit_list.append(int(digit))
    total = sum(digit_list)
    return total

number_input = input("Введите натуральное число: ")
number = int(number_input)
result = sum_digits(number)
output = "Сумма цифр: " + str(result)
print(output)
