"""2. Дана строка символов, в которой записано выражение, задающее сумму
двух чисел, представленных в восьмеричной системе, например ’731+22 ’. С
помощью функции oct_dec(s) перевода восьмеричного числа в десятичное
вычислить значение заданного выражения. """

def oct_dec(s):
    return int(s, 8)

expression = input("Введите выражение: ")
num1, num2 = expression.split('+')
result = oct_dec(num1) + oct_dec(num2)
print(f"Результат: {result}")
