"""4. Написать функцию, которая определяет, является ли число простым
is_simple(n). Написать программу, которая определяет с использованием
функции все простые числа из заданного диапазона [a,b]. """

def is_simple(n):
    if n < 2:
        return False
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False
    return True

a = int(input("Начало диапазона: "))
b = int(input("Конец диапазона: "))
primes = [num for num in range(a, b + 1) if is_simple(num)]
print("Простые числа:", primes)
